{"samples": [{"summary": "The TARDIS arrives in Little Hodcombe, Tegan wants to visit her Grandfather while they are there. Also, a war re-enactment is going on that starts to get more and more out of hand and realistic for unknown reasons."}, {"summary": "Warehouse worker Danny is recovering from a drug-induced haze when he encounters Alex jogging. They connect with one another, and become lovers. Danny introduces Alex to his older friend Scottie, and confesses to Alex about his past. Soon afterwards Alex disappears, and then Danny's flat is ransacked. Danny is mysteriously given the key to Alex's apartment, where he discovers Alex's dead body in a room dedicated to sado-masochism . He telephones the police, but remembering Alex's last words to him, he swallows a code-locked cylinder he finds in the battery compartment of Alex's laptop. The police tell Danny that Alex had lied to him: his name was actually Alistair and he wasn't an orphan. Scottie collects Danny from the police after supplying him with a solicitor, and tells him that Alex/Alistair was working for MI6. Before he leaves, Scottie tells him that the police were wondering if he had taken anything from Alex/Alistair's apartment. Danny lies and later passes the object he had swallowed."}, {"summary": "Frasier is becoming fed up with his father playing tricks on him, and mocking the effeminate scream that his pranks provoke. It happens that Frasier is treating a patient who has the rare condition of coulrophobia - fear of clowns. Part of the treatment he has planned is to dress up as a clown , so he has a very comprehensive costume. In a bid for vengeance on his father, Frasier disguises himself as a clown, which Martin hates. After Frasier jumps out at him wearing the outfit, Martin has a heart attack and is hospitalized. This spurs Martin to propose to Ronee while recovering."}, {"summary": "Michael feels ashamed when, during a safety training course, the warehouse employees make fun of him for having a safer work environment. Determined to show that office life can be dangerous, he decides to demonstrate depression effects by faking a suicide attempt. His plan to jump off of the roof and onto a bouncy castle go awry when the employees discover what he is doing and are forced to talk him down. Meanwhile, Andy attempts to endear himself to Dwight after returning from anger management."}, {"summary": "Andy attempts to make everyone's Christmas wishes come true. Erin, upset about her unrequited feelings for Andy, drinks too much at the Christmas party and is escorted home by California. Meanwhile, Dwight and Jim are ordered to stop pranking one another, lest they forfeit their Christmas bonuses. Thus, they try to frame each other."}, {"summary": "As the heroes attempt to rescue August from Gold and the Queens of Darkness in their quest to track down the Author, Hook finds a way to make a deal with Ursula to get the information he needs to help the heroes as a way to make up for what he did back in the past, in which Hook made a deal with Ursula's father Poseidon that led to unfortunate consequences for both Hook and a young Ursula."}, {"summary": "After Booth's \"funeral\" (which was in fact a covert operation, Booth being very much alive), a human jawbone shows up at the Jeffersonian, Brennan and the team quickly realize the Gormogon serial killer has struck again. In a shocking turn of events, an explosion in the lab injures Zack and Hodgins, Cam discovers that Gormogon's silver skeleton is missing from the basement vault. The team realize that it is an \"inside job\" and every Jeffersonian employee as well as Booth and Sweets become suspects."}, {"summary": "Crashing inside a newly formed planet, the Doctor and others find it inhabited by a slave labor mining society, where rocks are harvested for their radioactive energy and human life has little value. With a population controlled by deliberate cave-ins, poison gas, and periodic sacrifices to an Oracle, the miners, called Trogs, are also descendants from Minyos, and who desperately desire freedom."}, {"summary": "The Doctor makes it back to the colony and warns Ashe what Dent is up to but when Jo and Winton try to find proof they are captured."}, {"summary": "A record producer discovers Phoebe and wants to make her song \"Smelly Cat\" as a music video. The producer secretly dubs a more talented (but less attractive) woman's voice over Phoebe's, though Phoebe initially believes she is the one singing. Ross' new relationship with Rachel causes friction with Monica who resents her brother being around all the time. Joey finds he does not like living alone and wants to move back in with Chandler. However Chandler already has a new roommate, Eddie. Chandler soon realizes he does not really click with Eddie (who refuses to play foosball and dislikes Baywatch ) like he did with Joey."}, {"summary": "When the TARDIS materialises in the Himalayas, the Doctor decides to pay a return visit to the nearby Det-Sen monastery only to be accused of murder."}, {"summary": "In Episode one of the two-episode Classic series finale, Billie and Christy have managed to turn everything around: while the two of them are now at the Manor and demons are at Magic School, the Charmed Ones are forced to hide in the Underworld. The Jenkins and the Halliwells absorb the Hollow and attack each other in the Manor, not knowing the deadly consequences of their actions - Phoebe, Paige, and Christy are killed and the Manor is destroyed in a massive explosion caused by the biggest fight in Halliwell history."}, {"summary": "Mary Margaret grapples with her feelings for David and Emma grows increasingly suspicious of the Stranger while the events surrounding Prince Charming's wedding are revealed along with Snow White's struggle to ease her breaking heart and an offer that sets her on a path from which there is no coming back."}, {"summary": "North of the Seven Kingdoms of Westeros , Night's Watch soldiers are attacked by supernatural White Walkers . One soldier escapes but is captured at Castle Winterfell. Eddard \"Ned\" Stark , Warden of the North, executes him for desertion. Later, six orphaned dire wolf pups are found and one given to each Stark sibling, including Ned's bastard son, Jon Snow. In King's Landing, the Seven Kingdoms capital, Jon Arryn , the Hand of the King, dies suddenly. King Robert Baratheon , Ned's old friend, travels to Winterfell to recruit Ned and propose a marriage between his heir Joffrey and Ned's daughter, Sansa . Lysa Arryn, John's widow, sends her sister (Ned's wife), Catelyn , a letter claiming the Lannisters, Queen Cersei 's family, murdered Arryn. Catelyn believes the Lannisters are now plotting against King Robert. Ned's young son, Brandon , climbs a tall tower and witnesses Cersei and her twin brother, Jaime Lannister , inside having sex. To hide their incest, Jaime pushes Bran from the high window. Across the Narrow Sea in Essos, exiled Prince Viserys Targaryen forces his sister, Daenerys , to marry the Dothraki warlord, Drogo , in exchange for an army to conquer Westeros and reclaim the Iron Throne . Robert Baratheon became king after Jaime Lannister killed \"Mad\" King Aerys Targaryen, earning Jaime the nickname, \"The King Slayer\". The ancient Targaryens once commanded dragons, and Daenerys is given three fossilized dragon eggs as a wedding gift."}, {"summary": "The Doctor and Jo head to Stangmoor Prison to investigate the Keller Machine, which drains the evil impulses from prisoners' minds, while UNIT are handling security at the first world peace conference."}, {"summary": "With the Doctor, Jamie and Zoe trapped on a beacon segment, Hermack becomes suspicious of the unruly prospector Milo Clancey."}, {"summary": "Kai tells Bonnie and Damon to prepare for the eclipse that can bring them back home. Bonnie soon discovers that Kai knew nothing about the spell and kills him. He never was dead, but he needed a Bennett to help him go back home, so he tries to kill Bonnie and Damon once they were close to coming back home. While Bonnie is bleeding on the ground, Damon fights Kai, but Bonnie uses her magic to make sure Damon goes back home. Meanwhile, Elena and Liam go to Whitmore College Corn Maze. While there, Tyler accidentally runs over the entire corn maze with a truck due to someone running out in the middle of the street, so Elena and Tyler have to make sure no one dies because then Tyler would unlock his werewolf curse. Stefan tells Caroline to teach Ivy the vampire ropes. Ivy breaks Caroline's neck and Ivy decides to go feed, but did not know how to compel. Ivy gets captured at the end by Tripp. Stefan and Damon reunite."}, {"summary": "Michael thinks he has impressed Jo, only to discover that someone else in the office has caught her eye. Dwight makes trouble for Jim on his first day back from paternity leave. Andy and Erin go on their first date, with interesting results."}, {"summary": "Frasier is surprised to learn that Martin has been sleeping with a woman from his building. He then broadcasts this fact in his next show, embarrassing the woman and infuriating Martin. Feeling guilty, Frasier resolves to get them back together. Roz is going out with Noel Shempsky, a Star Trek addict."}, {"summary": "Arriving back in the courtroom, the Doctor starts his defense by showing the future beginning with his arrival onboard the spaceship Hyperion III which is on it's way from the planet Mogar to Earth with a cargo of rare metals. The Doctor shows the court that the TARDIS picked up a distress signal and he responded to it. Upon arrival, the Doctor tells Mel that he can sense evil. They are then captured and brought before Commodore Travers."}]}