{"samples": [{"summary": "In the second season premiere, the shocking and brutal murder of Miss Jeanette - Tara's fake exorcist - has the entire town of Bon Temps reeling. Tara is reluctant to tell the police she knew the deceased for fear that her ex-alcoholic mother will relapse if she finds out about Miss Jeanette's deception. She eventually comes forward and is interrogated. Her worst fears are realized when her mother, Lettie Mae, shows up at the police station and is told everything. Tara is eventually released, and Maryann has some harsh words for Lettie Mae when she arrives to give Tara a ride. Meanwhile, Lafayette has been kidnapped and is being held in a basement somewhere with others - including Royce, one of the rednecks who earlier burned three vampires to death. Sookie and Bill's relationship is put to the test with Bill's newly made vampire charge Jessica's impatient ways, even when Sookie attempts to bond with her. Jason impresses Steve and Sarah Newlin, the leaders of the Fellowship of the Sun anti-vampire church and is offered a place at a leadership retreat, where he will learn to serve God. Sam is troubled by the presence of Maryann. He has flashbacks about their sexual encounter when he was seventeen and stole one hundred thousand dollars from her. He also takes on another young waitress, Daphne. Tara becomes closer with Eggs. Sookie and Bill are put on even rockier ground when she discovers that he murdered her sexually abusive Uncle Bartlett. He tells her that he did it because he loves her too much to let him get away with what he did to her. Sookie forgives him and the two passionately make love. It is revealed that Eric is the one keeping Lafayette captive and the episode ends with Royce trying to escape and Eric feeding on and tearing him apart, spraying Lafayette with blood."}, {"summary": "Missing episode The TARDIS has arrived on a far-distant and seemingly idyllic world. Yet the Doctor, Steven and Dodo learn it hides a terrible secret: the apparently civilised Elders maintain their advanced society by draining and transferring to themselves the life-force of the defenceless Savages. Outraged at this exploitation, the Doctor is seemingly helpless to prevent it when some of his own life-force is tapped by the Elders' leader, Jano. In the process, however, Jano also acquires some of the Doctor's attitudes and conscience. Turning against his own people, he enlists the Savages to destroy the Elders' transference laboratory - a task with which the time travellers gladly assist. Steven agrees to remain behind on the planet to become leader of the newly united Elders and Savages."}, {"summary": "Lorelai's stint in the Stars Hollow High School local business success speakers forum gets derailed by some controversial personal questions, much to the delight of Luke and the consternation of some PTA mothers; Luke and Jess argue about the women in and out of their lives (and their closets); Lane alleviates her frustration about the strictures of her household and the future of her band through a colorful, if temporary, display of independence; Rory runs into Shane one too many times and succumbs to a severe bout of snarkiness."}, {"summary": "Chris begins Allison's training to become a werewolf hunter. At school, Erica, an epileptic girl, has a seizure and ends up in the hospital. There, Derek delivers the bite upon the promise that her illness will vanish. Dr. Deaton finds a dead hunter in his office and Chris wants him to find out what happened. Scott discovers Boyd is now a werewolf and is forced into a fight with Derek, Erica, and Isaac. Jackson is shocked when he exhibits inhuman strength."}, {"summary": "Veronica finds Abel Koontz's daughter, Amelia DeLongpre, and searches for evidence that Jake Kane paid Abel to falsely confess to Lilly's murder before Clarence Wiedman gets to Amelia. Veronica is hired to find out who is mysteriously harassing a classmate."}, {"summary": "Catherine and her team investigate when a hunter and a Kodiak bear are found dead in the mountains. Meanwhile Grissom's team look into the death of a young mother."}, {"summary": "With the Doctor, Jamie and Zoe trapped on a beacon segment, Hermack becomes suspicious of the unruly prospector Milo Clancey."}, {"summary": "Ross, Joey, and Chandler go on a ride-along with Phoebe's cop boyfriend, Gary. Believing there are gunshots (which is a car backfiring), Joey attempts to protect his meatball sandwich, though Ross believes he was trying to save him. Chandler then thinks Joey cares more about Ross than him. Meanwhile, while borrowing margarita ingredients from Ross' apartment, Rachel overhears Emily leaving a message saying she is having doubts about going through with her wedding and wants Ross to consider them getting back together. When Rachel accidentally deletes the message, she agonises over telling Ross."}, {"summary": "When two bodies covered in tar are found, the CSIs must try to uncover their identities and that of the murderer. Sara is reprimanded by Ecklie for improper conduct."}, {"summary": "Jamie and Victoria agree to accompany Astrid to Hungary to observe Salamander's activities."}, {"summary": "When a body is found badly burned in a chimney, Catherine and Warrick recall the house's owner as a suspect in an unsolved murder case a year earlier. Against protocol, the two then use the investigation of the burned victim as an excuse to re-open their case and inspect the house."}, {"summary": "Keith, again appointed sheriff after Lamb's death, interrogates Mindy O'Dell, who reveals that the third man in her hotel room the night of the Dean's murder was Dean O'Dell himself. Veronica and Tim set out to prove Professor Landry's innocence, and Veronica ends up uncovering the real murderer."}, {"summary": "When Cupid has his magic ring of love stolen by Drazi, the demon of hate, he turns to Phoebe for help in getting it back. However, when Drazi uses the ring to get Piper and Dan, Prue and Jack, and other couples to break up to destroy Cupid, Phoebe needs Prue to use her new power of astral projection to vanquish Drazi for good and get Cupid his ring back. To show his thanks before leaving town, Cupid gives Phoebe a parting kiss."}, {"summary": "The Doctor is forced to help the Master control the mind parasite while Yates finds out where the Thunderbolt has been taken only to be captured by the Master's men."}, {"summary": "Degrassi goes into chaos as Kevin Smith prepares to film the new Jay and Silent Bob movie there: Craig grows upset when Ashley prepares to go to London for the summer, and Caitlin begins spending a lot of time with Kevin and doubting her relationship with Joey."}, {"summary": "While Rebecca pays her last respects to her father, Kirsten grows impatient with Sandy's long absences from home and pays Rebecca a visit. Alex invites Marissa to hang out with her friends. Meanwhile, Caleb decides to remove all doubt that Lindsay is his daughter."}, {"summary": "Tom and Diana investigate a mysterious structure which is being built at a psychiatric hospital, based on the drawings of a schizophrenic 4400, Tess Doerner . Richard must protect his family when he and Lily are discovered to be 4400s. This is a two-part episode."}, {"summary": "Phoebe urges Monica to sing at Mike's piano bar. The audience loves her but only because the spotlight reveals she is not wearing a bra under her see-through blouse. Meanwhile, an angry, paranoid Ross is thinking Rachel is moving on 'without the courtesy of telling', then tries finding a date. Rachel, wanting to talk with Ross, realizes their arrangement is not working and moves back in with Joey, taking Emma with her. Note: This episode lasts for 30 minutes rather than the usual 22-23 minutes."}, {"summary": "A four-person rescue team from Triton arrives at Le Verrier Lab, a space station in the 38th century in orbit around Neptune which has fallen silent. They meet the Doctor and Clara, who claim to be assessors. They then meet Gagan Rassmussen, the last survivor of Le Verrier and creator of large pods called Morpheus, which reduces the time a person sleeps to allow them to work more but also mutates the rheum in the corner of the eye into a carnivorous life form called the Sandmen. Chopra, Deep-Ando, and 474 are killed during their escape. Rassmussen plans to use the rescue ship to return to Triton and release Morpheus there with a Sandman, which he says is now spread by spores. The Doctor destroys the gravity shields, sending the station and ship into Neptune. The Doctor comments that the inconsistencies in how Morpheus is spread seems to be contrived like a story. The Doctor, Clara, and Nagata escape in the TARDIS. Rassmussen, revealed to be a Sandman himself, orchestrated the events to use footage collated from people's vision to create a video that people would watch to transmit the Morpheus signal across the solar system to create more Sandmen."}, {"summary": "After Angela refuses to give in to Michael's unreasonable demands, Phyllis takes over the party planning committee and throws a huge bash for Toby's goodbye party. Dwight, with Meredith, hazes the new HR woman, Holly Flax ( Amy Ryan ), making her think Kevin is mentally disabled. Holly and Michael seem to make a romantic connection, which is cut short when Jan returns from Arizona, pregnant from a sperm donor; Michael ambivalently agrees to help her through the birth process. Pam accepts a three month training program in New York, and just as Jim is about to propose to her, Andy publicly proposes to Angela who reluctantly agrees. Angela is later caught having sex with Dwight in the office. Ryan's downfall is complete as he is dragged from the New York office after committing fraud related to the website."}]}