{"samples": [{"summary": "More lashing for Lucas and Tony. Rex, Mimi, and Cassie find out about the accident, and Rex realizes that Roman is his father and Cassie is still his full sister. Nicole is in trouble with Czar Victor, but it seems that murder is an option! Roman, Marlena, and company find out that Sami may never speak again, and they pray for her survival. Phillip and Tek work together on a mission. Meanwhile, Brady is still trying to push Chloe away so she can go for her dreams in opera. Bo and Hope bring Vin to Abe, and later they wonder if they should be Bounty Hunters!"}, {"summary": "Jack is alarmed to hear that Tess received a visit from Kevin, who claims to want to be her father. He's still very suspicious of Kevin and doesn't want Tess to be alone with him. Kevin tries to figure out why Lucy hasn't come back, then assumes that she's with Ian, as always. He records a message for her on his tape recorder, justifying what he's about to do for Livvie. To prepare for his plan for Tess, he sets the table for two, and is unpleasantly surprised to see that she has invited Jack to join them. On Caleb's private jet, Joshua puts the moves on Alison, who fends off his advances as tactfully as possible. She discovers Rafe hiding in a closet and they argue about his presence, which Alison fears can't possibly remain a secret from the others. Joshua drugs Elizabeth so that he can have some uninterrupted private time with her daughter. When Alison returns, Joshua comes on strong, unaware that he's under the slayer's watchful eye. When he hears a noise, he goes to investigate, and Alison cozies up to him to keep him from finding her co- conspirator. After drinking the special water, Chris is thrilled to think that he's actually a vampire. Ian and Lucy try to explain that this isn't good, but Chris escapes. They receive a tip that he's about to \"fly\" by jumping off a scenic overlook. As soon as he jumps, Ian grabs his wrist and dangles him in mid-air, then drags him to the ground. Chris angrily threatens to bite Ian, who gives him an injection to knock him out. They take Chris back to Ian's place, and Ian expects the symptoms to be gone by the time he wakes up. Lucy is proud of Ian for his heroics, and Ian appreciates her belief in his goodness. No Y &R "}, {"summary": "Sam tries to find out whether Jessica killed the John or not, and she finally breaks down and admits it. Then he tries to find out if Simone was the one who helped her clean up, and Simone came up with a story to cover them both, saying Jessica was admitting to getting her blood on her clothes when she was cutting herself again. When Sam sees her stomach is cut, he seems to believe her, then pulls the earring he gave Jess out of his pocket and asked how it got beside the dead guy in the hotel room. No answer yet. Theresa tried to get away from Alistair, but he made it clear she could go, but she'd never see Little Ethan again. Once she realized she couldn't leave, he tried to rape her again, but Katherine came in and stopped him, then went to get Ethan. By the time he got back, Alistair had forced Theresa to say words expressing how much she was enjoying herself, although she wasn't. Ethan believed she had lied to him, and a later encounter in the kitchen caused him to attack her verbally. Sheridan is still upset that Luis might be dead, changing from not even wanting to talk to him until he finds Marty to being in full mourning that he might be dead. Can you say \"two-faced\"? Martin starts to call Katherine, but Pilar catches him and he tried to make it sound innocent, only for Sheridan's sake. Pilar realizes Sheridan needs her mother, so she tells him to call her, but later overhears him saying he can't get the memories of Katherine out of his head. Chris tells the FBI man he won't leave because Sheridan needs him, and she begs him not to leave her and take James away. Gary gets a call from the FBI lab with the results of the DNA tests on the body they found, but didn't tell the answer today. Is it Luis or isn't it?"}, {"summary": "Thorne has punched Ridge. The Forresters argue about it. Eric says Ridge's new line stays and orders the two brothers to make peace or else. Darla and Thorne commiserate and support each other in private. Stephanie visits Ridge in his office to apologize for how she acted at the wedding. They argue about Thorne. Ridge threatens to get rid of Thorne and Darla, saying he has controlling interest now, with Brooke's shares and his. Darla confronts Ridge in his office. Caitlin keeps getting the brush-off from Rick so she insists on speaking with him about their relationship. He tells her everything but she changes his mind about her being too young or listening to Ridge. They rush off to the Big Bear cabin for the afternoon. Amber pumps Ozzy for information about the Ingenue line; she is not thrilled to find out that Caitlin is not only designing but modeling. She had hoped to get involved to win back Rick."}, {"summary": "Salem attends the grand opening of Alice's. Bonnie sneaks into the kitchen to spice up Julie's cooking. Everyone enjoys Bonnie's cooking. Bonnie makes Rex and Philip dress scantily to attract customers. Patrick talks with his acquaintance to try and convince him not to harm Jennifer. Jennifer lies and sneaks around to get to the airplane where she plans to meet Jack. Kate and John try to convince Belle and Philip that they should consider dating each other. Jan pretends to be Belle as she tells Shawn that \"she\" doesn't love him anymore. Belle wants John to help her get on a Nascar race broadcast so she can appeal to Shawn via the television airwaves. John wants Belle to promise to give up on Shawn if he doesn't come back after her appeal."}, {"summary": "Chad offered to bribe the homeless guy so he would tell what happened the night Serena was killed. Abby tried on wedding dresses. While she was trying on dresses, Jennifer let Abby know that she didn't like Clyde buying a house for her and Ben. Abby and Jennifer talked a little about it. Abby wanted Theresa to design her dress. Jennifer was surprised by Abby's decision. Ben thought about killing Serena and Paige. Chad took money from the DiMera safe. Chad didn't know who Andre was until he introduced himself. Stefano found out that Chad wanted the money to bribe the guy to talk to the police. Chad and Andre talked about the case. Theresa let Anne know that she has to change so she couldn't hang out with her anymore. Abby texted Theresa about designing a wedding dress for her. Chad went back to the pier, but the homeless guy didn't remember him. Jennifer went to see Eve. Justin went to the DiMera mansion to search for evidence. Eve was upset that Paige went to Jennifer. Eve lashed out at Jennifer because she couldn't relate to her loss. Chad told the homeless guy that he needed him to talk to Rafe. They guy didn't remember Chad anymore. Justin found something of Sonny's and realized where Chad was hiding. Chad got a text message that Justin knew where he was hiding. Jennifer tried to help Eve, but she didn't want her help. Eve threw her out of her apartment. The police went to the shed to look for Chad. Chad texted Stefano to let him know he was safe."}, {"summary": "River runs after confessing to Michael. Glo is taken to jail, while everyone searches for Michael. Michael is at Heather's office issuing a warrant for River's arrest. Heather struggles with her oath to uphold justice and love for Adam as he ask her to run with him to Europe."}, {"summary": "Karen is annoyed when David and Nikki continue to flirt. Jana contacts Kevin online. He is more determined than ever to find her. Victoria and Brad tell Abby about their divorce. She is extremely angry and says she hates them both. Brad tells Victoria about the deal he cut with the DA and that he won't be selling the Clear Springs properties to Nikki. Victoria freezes their joint assets. She sees JT later and goes to his house with him. Brad goes to JT's apartment and knows they are together. JT tells Victoria he knows she is pregnant. Jack tells Sharon, Ben and Phyllis about what he overheard. They plot about how they can use this against Nikki. They decide to dig up as much dirt as possible against David involving his personal life. Sharon tries to get close to Karen. Meanwhile, Phyllis is up and around every time she is alone and it is all being recorded on the nanny-cam. Phyllis finds the nanny- cam and makes sure that Jack finds it. Sharon admits she put it there and they watch it. Of course Phyllis has recorded over the tape with footage of her just laying on the couch. She puts on a real show saying that Sharon has every right to not trust her. Daniel tries to find someone to lend him the money to cover the money that was stolen from him. When he asks Amber, she asks him to help her to find Garrett a job. She gets secret cell phones so she and Daniel can talk to each other without their spouses knowing. Cane isn't too happy when he catches them together again and tells them to stay away from each other. They use the phones to confirm Garrett's fake references. Daniel later asks Phyllis for a loan. She overhears him giving the fake reference to Cane and tells him she thinks he is a liar and won't give him anything. Later, Garrett is shown laying DEAD in Kevin's apartment!"}, {"summary": "Nick unsuccessfully tried to talk Summer out of getting married tomorrow. Jack reassured Billy when he worried about raising the kids alone. Billy was angry when Phyllis showed up to support the defendants. Tessa got out on bail and went to support Mariah during the verdict. The defendants were found guilty. Abby confronted Summer about the wedding and asked if she was the donor. Summer said no. Abby vowed to figure out what Summer was up to. Billy lashed out at Michael for what he considered a bad legal defense. Nick approached Billy with the theory that JT was alive and suggested they combine resources to find him. Billy agreed to help. Mariah blamed Nick for Tessa getting arrested. Nick advised Mariah to cut Tessa loose. Mariah refused. Christine asked the judge to give the defendants the maximum. Phyllis blamed herself over the verdict. Phyllis told Kerry that she had a plan to keep Ashley's products off the market, and she asked Kerry to keep it secret from Jack. Kerry agreed to. Kerry called someone and said she'd hit the motherlode. Phyllis made plans to sell Jack of Hearts in stores. The defendants lawyers and loved ones spoke on their behalf, but in the end, Nikki received thirty years in prison, Victoria was sentenced to ten years, and Sharon was given three. "}, {"summary": "Carly is delighted when Jax believes that Kate did set her up to appear to lie in order to sabotage Crimson and he threatens to remove Kate from the magazine. Ric threatens legal maneuvers against Scotty that will get Johnny freed, and even Alexis is impressed enough to be willing to cut a deal, but Scotty remains in charge of the case, despite conflict of interest issue. Jax and Carly plan to attend Sonny's wedding and Kate does want them there, as a sign that all things are cool. Mike fears Sonny and Carly will reunite. Spinelli gets an infection and takes a turn for the worse, thanks to phony drugs. Robin continues to resist marriage, despite being ganged up on by her mom, Patrick and friends. She is just worried about her ill father and keeping his secret."}, {"summary": "Brooke is incredulous that Stephanie could have fed the information to Andy. As horrible as it is, Ridge does believe she made it possible for that bastard to do this to Brooke. All the pieces fit. It's a sick obsession, but how and why would she do this? They call Stephanie's cell phone and both leave a message. Brooke was raped and she says they will never ever forgive her. Ridge asks if Brooke wants to press charges; Stephanie could be prosecuted as an accomplice? He just wants her out of his life. They leave for the Forrester house to get some answers from Stephanie. Eric frantically searches the desk drawers at home looking for any more clues. In a locked drawer, he finds Andy's number on a piece of paper. Bridget interrupts and she realizes that her dad knows about Brooke's rape, and that he still loves her. Both Ridge and Eric think they hear or saw Stephanie leaving the house. They do find a letter left for Brooke. She reads it. It's from Stephanie admitting her involvement with Andy and how terribly sorry she is for this to have happened. She went too far and though good intentioned, what she did was unforgivable. She was only trying to protect Brooke's children. She knows Brooke will never forgive her, and she needs some time away to forgive herself. Once again Brooke is incredulous; sorry \u0096 that isn't good enough! She berates Stephanie for all the years of looking down at her and that condescending tone when all she wanted was to be accepted. She goes in a tirade; tearing and crumpling up the letter and insisting that she wants Stephanie's head served up on a silver platter. She screams coward over and over and throws picture after picture of Stephanie to the floor in disgust. She claims that Stephanie tried to ruin her, but she is not going to let her. She vows she will always be the woman she was. When all is said and done, she will not let this beat her, she will be stronger. She will be a survivor, proud and strong!"}, {"summary": "Billy remembered finding Delia's doll in his bed. Victoria arranged for Nick to have a supervised visit with Christian. Kyle got an ominous text from Theo asking if he had any final wishes. Abby, Mariah and Tessa joined Lola as she got ready for the wedding. They had a heart to heart and vowed to be friends forever. Lola let Rey know how grateful she was for him stepping up as a father figure. Jack brought Celeste back to Genoa City, and she and Lola made amends. Kyle got cold feet because none of the Abbotts had ever had a successful marriage. Traci and Ashley calmed his nerves by giving him sage advice. Summer decided it was important to go to the wedding because she'd always care about Kyle. She hoped they'd both find happiness even if it wasn't with each other. Phyllis accepted Summer's invitation to be her plus one. Nate, Elena and Devon were wedding guests. Celeste and Rey walked Lola down the aisle. Celeste noticed Adrian, Lola's father, lurking outside the wedding, and she ordered him to respect Lola's wishes and leave, but he secretly stayed. The wedding went smoothly, and Kyle and Lola became husband and wife. "}, {"summary": "Jack admits to Phyllis that he used Gloria to sabotage Lauren's potential investors. Lauren manages to find another investor whom she is keeping a secret from everyone. She plans to meet with the investor tomorrow. Billy and Victoria have a big argument, because Victoria is upset that Billy didn't tell her that he had the sex talk with Reed. Reed thinks Victoria is cold and mean for treating Billy so badly for giving him advice and advises Victoria not to cut Billy out of Johnny and Katie's life. Kevin informs Paul that Fisk has been arrested, but Dylan is still missing. Paul continues to look for him, but he is relieved that the blood found at the warehouse didn't belong to Dylan. Fisk tells Paul that he has no idea where Derek is, and he thinks that one of his associates took him. Paul finds a bracelet that Dylan wears as part of his disguise while he is undercover and worries that Dylan may be dead. Christine tells Sharon that Dylan did his job and has gone missing. Sharon hopes that Dylan will come home soon. While she is looking at a picture of the two of them, Dylan arrives home. "}, {"summary": "Durant makes a move against Alcazar and Steven. The mystery person continues his work at Sonny's house and makes contact with his associate. Helena gets a surprise when she makes her move against Emily, who is in danger. Sonny is surprised when Jordan arrives on the island."}, {"summary": "Britney harasses Cole about the latest behavior of the Manning family. Layla overhears Adriana and Rex's plan that they move in together. Nora reminds Will that Lindsay has to pay for murdering Spencer Truman. Marcie visits Lindsay in jail and encourages her to believe that she will soon be free. Todd explains to Starr and Blair how the custody hearing went from bad to worse. Michael tells John that Todd's behavior in court helped him to win sole custody of Tommy. Will accuses Nora of carrying out a vendetta against Lindsay because of their hatred for each other down through the years. Layla is extremely upset with Adriana for not consulting with her before she agreed to move in with Rex. Rex suggests that Layla and Vincent move in together to share expenses. Sarah bets Cristian that she can book a well-known band to play at Capricorn within one week or she will be out of his life for good. Starr lets Langston, Cole, and Markko know why she is supporting her father in his custody battle against Marcie and Michael. Rex assures Adriana that he will handle things if Blair tells their secret to Todd. Sarah begs Layla to take her on as a roommate. Blair and Todd each make separate plans to regain custody of Tommy from the McBains. Blair visits Lindsay in jail and tells her that she will help her if Lindsay will help Todd gain custody of Tommy. Todd visits Marcie and Michael and wants to buy Tommy back from them."}, {"summary": "Ian regains consciousness to find that Kevin is building a wall to seal him in. He realizes that he can't move, and Kevin informs him that it's because of the drug he injected. Kevin sharpens a stake in preparation for killing his wife's vampire lover. Ian's strength returns and he busts through the wall. He attacks Kevin but thinks better of biting him. Instead, he takes off to save Lucy. Livvie tries to stop Caleb from leaving her, but he feels obligated to go to the hot spring when he senses a problem there. Before leaving, he gives Livvie his ring for protection. Jack is angry with Rafe and the others for killing Caz and Reese, but he soon learns that they've been cured, not killed. Caz takes the change very well, but Reese is furious. Joshua listens the happenings at the hot spring, disgusted by Caz's elation at being human again. Jamal and Casey help Caz back aboveground. Alison tries to help Reese and is rewarded with a slap in the face. Rafe insists that Alison leave before Caleb shows up. After promising Alison that she won't take her eyes off Rafe, Lucy decides to try to find Ian, but she's stopped by Caleb's arrival. Joining hands with Caz and Jamal, Casey leads a unique prayer for help for her friends still underground. Reese blames Jack for her inability to bite Alison. Alison is stunned by Jack's loyalty to Reese. Rafe uses his slayer powers against Caleb, who gets the better of the slayer by rendering him immobile. Caleb then grabs Lucy, who turns on the music. Caleb's attempt to break her neck is stopped by Rafe, who manages to push the head vampire into the healing pool. Lucy falls in with him. As soon as they hit the water, the mysterious red light bathes the entire area. When Caleb emerges from the water as a human, he congratulates Rafe but vows that this isn't over. Livvie screams when she realizes what has happened to her lover. Joshua toasts his victory just before flipping the detonator switch. Still listening, he hears the blast from the explosion."}, {"summary": "Sonny shows up just as Johnny's car explodes. Johnny pushes Kristina out of the way. Johnny accuses Sonny of setting up the car bomb. Sonny tells Mac that the Lopez brothers are to blame. Alexis gets a call that Kristina has been admitted to the hospital. Steven informs Alexis that Kristina will be okay. Alexis slaps Johnny. Michael overhears Sonny and Max talking about their involvement in the car bomb. Alexis asks Sonny if he was involved in the car bomb. Maxie is scared to be in the same room with Franco. Franco tells Maxie to say hi to Jason. Jason and Dante speak to Karen, supposedly Franco's mom. Karen says that she doesn't have a son. Later on, Franco pays a visit to Karen. Jason, Spinelli, and Dante are shocked to find out that Maxie spoke to Franco. Jax and Skye talk about his marriage to Carly. Patrick realizes he made a mistake by sleeping with Lisa. Patrick and Lisa show up at the hospital to check on Shirley's condition. Patrick returns home and finds that Robin has returned from Johannesburg."}, {"summary": "Jana visits Daisy at Daniel's loaded with presents and fixings for a Christmas dinner. Chloe visits the coffeehouse and sees Kevin which unnerves her. Katherine walks in to referee the two. Heather is in the foyer of the coffeehouse when Ronan walks in. They discuss his illness and the possible test that he has to undergo. Ronan gets a call from his doctor in Boston. Sofia and Neil go over the deal that they are working on for Tucker. Sofia feels that Tucker will be pleased. Sofia presents Neil with a present. Jill comes into the living room and asks when they are ever going to decorate the Christmas tree. Nina stands at the bar. Lily and Cane take the twins to the park when they run into Daniel. Cane leaves Lily alone with Daniel. Lily gives Daniel one of the twins to hold while she gets the other one. Kevin comes to visit Daisy and finds Jana there. Daisy lets Kevin know that Jana is bribing her with food so that Daisy will give her baby to Jana. Kevin thanks Jana for her help. Neil opens his present and finds it to be a \"Gravy Haven\" cookbook. Colin visits Jill with present in hand and asks her if she had been a good girl. Jill smiles. Colin gives Jill a date book to pencil his name on every page. Katherine and Chloe arrive home just as Colin is leaving. Chloe wants to know all about Colin. Heather arrives at Ronan's with takeout in hand. Abby runs into Daniel and he invites her out for a drink. Everyone begins to arrive at Malcolm's and Sofia's with presents in hand. Sofia questions Cane as to what is going on with him since he doesn't have that much work to do for Tucker. Cane opens up to Sofia, but urges her not to say anything. Malcolm walks out and wants to know what is going on. Heather encourages Ronan to let Nina in his life. Kevin arrives at the Chancellors' and asks to see Katherine. Katherine comes out to join them. Kevin and Chloe begin to decorate the tree. Katherine takes a pic of them. Ronan and Heather visit the park and have a snowball fight. Heather pulls off down to her bar and lies down in snow and makes an angel. Ronan follows suit and lies down beside Heather and kisses her. Daniel and Abby have a drink together and he vows to get her back. Jana arrives at the Chancellors' with a present for Delia. Jana starts to leave, but Kevin invites her to stay. Sofia and Malcolm set a wedding date for Valentine's Day. Colin sends the twins a Christmas present. Cane calls Colin and tells him that they need to talk. Heather and Ronan arrive at the Chancellors' for dinner. Nina is thrilled. "}, {"summary": "Sam and T.C. try to help Theresa, Chad, Whitney, and Fox out of the fire but become trapped. Luis leaves Beth's to go outside and talk to the other cops because they say they know where Sheridan is. Meanwhile, Edna and Beth are under pressure because they believe Luis knows the truth about where Sheridan is. Kay arrives at her baby shower but the attention is quickly taken from her when Charity has premonitions."}, {"summary": "Deimos ran into Maggie at the town square. She wanted to know why he wanted to hurt Victor. Deimos said Victor didn't tell her the truth. Victor told Caroline about Deimos seducing his fiancée. Victor also told Caroline how Deimos went to prison for his fiancée's death. Caroline wondered if Victor killed his fiancée. He said it was an accident. Philip was upset with Belle for not knowing what she wants from him. Ciara was upset when she ran into Chase. Claire wanted Chase to tell her what was going on. Victor told Maggie what happened with Deimos. Philip wanted to be with Belle exclusively. Claire wanted to know what Chase did to Ciara, but he didn't answer her. Claire came on to him and got him to meet her later. When Claire went to find Ciara, Theo approached Chase and asked him what he did to Ciara. Chase refused to answer him. Claire found Ciara at Jennifer's house. Claire wanted to know what happened with Ciara. Claire figured out that Chase raped Ciara. Belle wasn't ready to be with Philip. Claire told Ciara to go to the hospital to get checked out, but Ciara didn't want to go. Claire also suggested that Ciara tell Hope what happened, but Ciara didn't want her to know. Theo showed up to check on Ciara. When Hope came home, Ciara didn't tell her the truth. Victor went to see Deimos and told him to leave town. Caroline had a vision of Victor having a heart attack. Victor cut Deimos with a knife. When Victor left, Deimos put the knife through Victor's picture."}]}